InformationRegisters/доп_ИсторияЗвонков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_ИсторияЗвонков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаписьРазговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ТипЗвонка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Успешность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НабранныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/доп_ИсторияЗвонков/Forms/ФормаПросмотраЗвонка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДлительностьЗвонка = доп_ТелефонияКлиентСервер.ФорматироватьДлительностьЗвонкаСЛидНулями(Запись.ДлительностьЗвонка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьРазговораОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	стрПутьКЗаписи = Запись.ЗаписьРазговора;
	Если ЗначениеЗаполнено(стрПутьКЗаписи) Тогда
		доп_БитфонКлиент.ВоспроизвестиЗаписьРазговора(стрПутьКЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БитИсторияЗвонков_СохранениеФайлаЗаписиРазговораЗавершение" Тогда
		Если ЗначениеЗаполнено(Параметр.Результат) Тогда
			данныеЗапись = Параметр.ПараметрОповещения;
			имяФайла = Параметр.Результат[0];
			данныеЗапись.Записать(имяФайла);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкачатьЗапись(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЗаписьРазговора) Тогда
		Возврат;
	КонецЕсли;
	
	стрСервисЗаписейНаАТС = доп_АТСКлиент.ПутьСервисаЗаписейРазговоровНаАТС();
	индЗаголовокЗап = Найти(Запись.ЗаписьРазговора, стрСервисЗаписейНаАТС);
	Если индЗаголовокЗап = 0 Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("Скачивание записи разговора возможно только для записей, хранящихся на ОЛИМП.АТС", ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	данныеЗапись = Неопределено;
	стрОшибкаHTTP = "";
	загружено = доп_ТелефонияКлиентСервер.СкачатьПоHTTPS(Запись.ЗаписьРазговора, 900, Ложь, данныеЗапись, стрОшибкаHTTP);
	
	Если загружено Тогда
		длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		длг.ПолноеИмяФайла = доп_ТелефонияКлиент.ПолучитьИмяФайлаЗаписиСДатой(Запись.Дата) + ".mp3"; 
		длг.Фильтр = "Файл mp3 (*.mp3)|*.mp3";
		доп_ТелефонияКлиентПереопределяемый.ПоказВыборФайла(длг, "БитИсторияЗвонков_СохранениеФайлаЗаписиРазговораЗавершение", данныеЗапись);
	Иначе
		доп_ТелефонияКлиент.ВывестиСообщение(стрОшибкаHTTP, ЭтаФорма);
		доп_ТелефонияКлиент.ВывестиСообщение("Ошибка загрузки записи разговора", ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВоспроизвестиЗаписьЧерезМонитор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЗаписьРазговора) Тогда
		Возврат;
	КонецЕсли;
	
	стрСервисЗаписейНаАТС = доп_АТСКлиент.ПутьСервисаЗаписейРазговоровНаАТС();
	индЗаголовокЗап = Найти(Запись.ЗаписьРазговора, стрСервисЗаписейНаАТС);
	Если индЗаголовокЗап = 0 Тогда
		доп_ТелефонияКлиент.ВывестиСообщение("Прослушивание записи разговора на стационарном телефоне возможно только для записей, хранящихся на ОЛИМП.АТС", ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	доп_АТСКлиент.ОткрытьМониторВоспроизвестиЗаписьРазговора(Запись.ЗаписьРазговора);
	
КонецПроцедуры

#КонецОбласти
